app/controllers/diary_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]
SELECT "activities".* FROM "activities"
---
  def list
    @activity = Activity.where(:user_id => @current_user.id)
    @activity_by_date = @activity.group_by(&:date)

INSERT INTO "activities" ("user_id", "date", "alcohol", "exercise", "reading", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    p = params.require(:activity).permit(:user_id, :date, :alcohol, :exercise, :reading, :comment)
    @activity = Activity.create(p)

SELECT  "activities".* FROM "activities" WHERE "activities"."date" = ? LIMIT 1  [["date", "2015-09-03"]]
---
  def edit
    @activity = Activity.find_by(date: params[:date])

SELECT  "activities".* FROM "activities" WHERE "activities"."date" = ? LIMIT 1  [["date", "2015-10-02"]]
---
  def update
    @activity = Activity.find_by(date: params[:activity][:date])