app/controllers/stat_controller.rb

  def show
    @activity = Activity.where(:user_id => @current_user.id)
    @date = params[:date] ? Date.parse(params[:date]) : Time.zone.today.to_date
    @week = (@date-7)..@date

    if @activity.count == 0
---
SELECT COUNT(*) FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]